{
    "broadArea": {
        "name": "Electrical Engineering",
        "link": "https://www.vlab.co.in/broad-area-electrical-engineering",
        "code": "EE"
    },
    "lab": "Mechatronics System Design Lab",
    "lab_display_name": "Mechatronics System Design Lab",
    "phase": "3-ext",
    "collegeName": "COEP",
    "baseUrl": "msd-coep.vlabs.ac.in",
    "introduction": "The Mechatronics System Design Virtual Lab has been developed to provide an interactive and realistic environment for understanding the integration of mechanical, electronic, and control components. This virtual platform enables learners to explore how different sensors and actuators are interfaced with the Arduino Uno microcontroller and how these elements work together to form a complete Mechatronic system.<br><br>In this lab, students can perform sensor connections, observe signal responses, and understand the working principles without the need for physical hardware. The virtual setup replicates real-world circuit behaviour, allowing users to build, modify, and test Mechatronic circuits safely and efficiently.<br><br>The lab incorporates a variety of commonly used sensors, including LED indicators, switches, an IR sensor, a temperature sensor, an encoder, and a proximity sensor. Each sensor demonstrates its specific method of sensing and signal generation, offering learners hands-on experience with digital and analog interfacing. The Arduino Uno acts as the central controller, reading sensor inputs, processing data, and generating appropriate output signals based on programmed logic.<br><br>Through this virtual environment, learners gain practical insights into sensor operation, microcontroller programming, and system integration-key skills essential for designing and developing modern mechatronic systems. The lab enhances conceptual understanding, improves debugging skills, and prepares students for real-time applications in robotics, automation, and embedded system design.",
    "experiments": [
        {
            "name": "I/O Programming - Interfacing of LED and Switch",
            "short-name": "io-programming-led-switch",
            "repo": "https://github.com/virtual-labs/exp-io-programming-interfacing-led-switch-coep",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "I/O Programming - Interfacing of Proximity switches and Relays",
            "short-name": "io-programming-proximity-switches-relays",
            "repo": "https://github.com/virtual-labs/exp-io-programming-interfacing-proximity-switches-relays-coep",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Interfacing of IR Sensors and proximity sensors",
            "short-name": "interfacing-ir-proximity-sensors",
            "repo": "https://github.com/virtual-labs/exp-interfacing-ir-sensors-proximity-sensors-coep",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Interfacing of Analog Sensors",
            "short-name": "interfacing-analog-sensors",
            "repo": "https://github.com/virtual-labs/exp-interfacing-analog-sensors-coep",
            "tag": "v1.0.0",
            "deploy": true
        },
        {
            "name": "Interfacing of Encoders",
            "short-name": "interfacing-encoders",
            "repo": "https://github.com/virtual-labs/exp-interfacing-encoders-coep",
            "tag": "v1.0.0",
            "deploy": true
        }
    ],
    "targetAudience": {
        "UG": [
            "(2ndYear, 3rd Year) 3rd, 4th, 5th and 6th Semesters of Mechanical, Electrical, Manufacturing, Mechatronics, and Instrumentation programs"
        ],
        "PG": [
            "(1st Year) 1st, 2nd Semester of Mechanical, Electrical, Manufacturing, Mechatronics, and Instrumentation programs."
        ]
    },
    "objective": "<ul><li>The Mechatronics System Design Virtual Lab focuses on the application of theoretical principles and the use of embedded systems for electromechanical systems incorporating sensors, actuators, and data processing.</li><li>To learn the use of Arduino-based embedded systems for interfacing, data processing and control of sensors, actuators, displays, and real-time embedded software for designing mechatronics systems like robots, autonomous vehicles, etc.</li><li>To design electromechanical systems and to gain a deeper understanding of hard-to-grasp topics by letting them interact by changing parameters, sensor inputs, and actuator voltages, to analyse the electromechanical designs.</li></ul>",
    "courseAlignment": {
        "description": "The syllabi of this lab aligns to the following universities in India.",
        "universities": [
            "Department of Mechanical Engineering, M.Tech: Mechatronics, NIT Surathkal",
            "Department of Mechatronics, B. Tech: Mechatronics, MIT Manipal",
            "School of Mechanical Engineering, M.Tech: Mechatronics, VIT Vellore",
            "Department of Mechatronics Engineering, B. Tech/M.Tech Mechatronics",
            "SRM University",
            "School of Mechatronics and Robotics, M.Tech: Mechatronics, Indian Institute of Engineering science and technology, Shibpur"
        ]
    }
}
